spec/fixtures/files/stripe/failed_card/payment_intent.payment_failed.json

{
  "id": "pi_3MLpbZFUSUvjNxGl1fxX07W7",
  "object": "payment_intent",
  "amount": 280000,
  "amount_capturable": 0,
  "amount_details": { "tip": {} },
  "amount_received": 0,
  "application": null,
  "application_fee_amount": null,
  "automatic_payment_methods": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [
      {
        "id": "ch_3MLpbZFUSUvjNxGl1TBJECVZ",
        "object": "charge",
        "amount": 280000,
        "amount_captured": 0,
        "amount_refunded": 0,
        "application": null,
        "application_fee": null,
        "application_fee_amount": null,
        "balance_transaction": null,
        "billing_details": {
          "address": {
            "city": null,
            "country": "TW",
            "line1": null,
            "line2": null,
            "postal_code": null,
            "state": null
          },
          "email": "admin@gmail.com",
          "name": "test_failed",
          "phone": null
        },
        "calculated_statement_descriptor": "AMICAT PURCHASE",
        "captured": false,
        "created": 1672672255,
        "currency": "twd",
        "customer": "cus_N5zxtved7o3FPc",
        "description": null,
        "destination": null,
        "dispute": null,
        "disputed": false,
        "failure_balance_transaction": null,
        "failure_code": "incorrect_cvc",
        "failure_message": "Your card's security code is incorrect.",
        "fraud_details": {},
        "invoice": null,
        "livemode": false,
        "metadata": {},
        "on_behalf_of": null,
        "order": null,
        "outcome": {
          "network_status": "reversed_after_approval",
          "reason": "requested_block_on_incorrect_cvc",
          "risk_level": "normal",
          "risk_score": 60,
          "rule": "block_if_wrong_cvc",
          "seller_message": "You requested that Stripe block payments (like this one) for which the customer-entered CVC code does not match the code on file with the card-issuing bank.",
          "type": "blocked"
        },
        "paid": false,
        "payment_intent": "pi_3MLpbZFUSUvjNxGl1fxX07W7",
        "payment_method": "pm_1MLpf8FUSUvjNxGlbFX4xg0Z",
        "payment_method_details": {
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "fail"
            },
            "country": "US",
            "exp_month": 12,
            "exp_year": 2034,
            "fingerprint": "EL1xfms1rP7M6Vnd",
            "funding": "credit",
            "installments": null,
            "last4": "0101",
            "mandate": null,
            "network": "visa",
            "three_d_secure": null,
            "wallet": null
          },
          "type": "card"
        },
        "receipt_email": null,
        "receipt_number": null,
        "receipt_url": null,
        "refunded": false,
        "refunds": {
          "object": "list",
          "data": [],
          "has_more": false,
          "total_count": 0,
          "url": "/v1/charges/ch_3MLpbZFUSUvjNxGl1TBJECVZ/refunds"
        },
        "review": null,
        "shipping": null,
        "source": null,
        "source_transfer": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "failed",
        "transfer_data": null,
        "transfer_group": null
      }
    ],
    "has_more": true,
    "total_count": 2,
    "url": "/v1/charges?payment_intent=pi_3MLpbZFUSUvjNxGl1fxX07W7"
  },
  "client_secret": "pi_3MLpbZFUSUvjNxGl1fxX07W7_secret_dYiJeFZOrNlTMbsSo95tlyT27",
  "confirmation_method": "automatic",
  "created": 1672672033,
  "currency": "twd",
  "customer": "cus_N5zxtved7o3FPc",
  "description": null,
  "invoice": null,
  "last_payment_error": {
    "charge": "ch_3MLpbZFUSUvjNxGl1TBJECVZ",
    "code": "incorrect_cvc",
    "doc_url": "https://stripe.com/docs/error-codes/incorrect-cvc",
    "message": "Your card's security code is incorrect.",
    "param": "cvc",
    "payment_method": {
      "id": "pm_1MLpf8FUSUvjNxGlbFX4xg0Z",
      "object": "payment_method",
      "billing_details": {
        "address": {
          "city": null,
          "country": "TW",
          "line1": null,
          "line2": null,
          "postal_code": null,
          "state": null
        },
        "email": "admin@gmail.com",
        "name": "test_failed",
        "phone": null
      },
      "card": {
        "brand": "visa",
        "checks": {
          "address_line1_check": null,
          "address_postal_code_check": null,
          "cvc_check": "fail"
        },
        "country": "US",
        "exp_month": 12,
        "exp_year": 2034,
        "fingerprint": "EL1xfms1rP7M6Vnd",
        "funding": "credit",
        "generated_from": null,
        "last4": "0101",
        "networks": { "available": ["visa"], "preferred": null },
        "three_d_secure_usage": { "supported": true },
        "wallet": null
      },
      "created": 1672672255,
      "customer": null,
      "livemode": false,
      "metadata": {},
      "type": "card"
    },
    "type": "card_error"
  },
  "livemode": false,
  "metadata": {},
  "next_action": null,
  "on_behalf_of": null,
  "payment_method": null,
  "payment_method_options": {
    "card": {
      "installments": null,
      "mandate_options": null,
      "network": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": ["card"],
  "processing": null,
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "requires_payment_method",
  "transfer_data": null,
  "transfer_group": null
}
