spec/fixtures/files/stripe/others/payment_intent.canceled-2023011109-52-03.json

{"id":"pi_3MOX0OFUSUvjNxGl2sVRXmoO","object":"payment_intent","amount":220000,"amount_capturable":0,"amount_details":{"tip":{}},"amount_received":0,"application":null,"application_fee_amount":null,"automatic_payment_methods":null,"canceled_at":1673401923,"cancellation_reason":"automatic","capture_method":"automatic","charges":{"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/charges?payment_intent=pi_3MOX0OFUSUvjNxGl2sVRXmoO"},"client_secret":"pi_3MOX0OFUSUvjNxGl2sVRXmoO_secret_bKKDQCUQuCi6wOJcBqz5nOWK7","confirmation_method":"automatic","created":1673315520,"currency":"twd","customer":null,"description":null,"invoice":null,"last_payment_error":null,"livemode":false,"metadata":{},"next_action":null,"on_behalf_of":null,"payment_method":null,"payment_method_options":{"card":{"installments":null,"mandate_options":null,"network":null,"request_three_d_secure":"automatic"}},"payment_method_types":["card"],"processing":null,"receipt_email":null,"review":null,"setup_future_usage":null,"shipping":null,"source":null,"statement_descriptor":null,"statement_descriptor_suffix":null,"status":"canceled","transfer_data":null,"transfer_group":null}