spec/fixtures/files/stripe/successful_card/payment_intent.created.json

{
  "id": "pi_3MLoTUFUSUvjNxGl2jjXpR4N",
  "object": "payment_intent",
  "amount": 280000,
  "amount_capturable": 0,
  "amount_details": { "tip": {} },
  "amount_received": 0,
  "application": null,
  "application_fee_amount": null,
  "automatic_payment_methods": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges?payment_intent=pi_3MLoTUFUSUvjNxGl2jjXpR4N"
  },
  "client_secret": "pi_3MLoTUFUSUvjNxGl2jjXpR4N_secret_y5zQMJz4MVWy469bWGmzlZVIz",
  "confirmation_method": "automatic",
  "created": 1672667688,
  "currency": "twd",
  "customer": "cus_N5zxtved7o3FPc",
  "description": null,
  "invoice": null,
  "last_payment_error": null,
  "livemode": false,
  "metadata": {},
  "next_action": null,
  "on_behalf_of": null,
  "payment_method": null,
  "payment_method_options": {
    "card": {
      "installments": null,
      "mandate_options": null,
      "network": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": ["card"],
  "processing": null,
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "requires_payment_method",
  "transfer_data": null,
  "transfer_group": null
}
