spec/fixtures/files/stripe/successful_card/payment_intent.succeeded.json

{
  "id": "pi_3MLoTUFUSUvjNxGl2jjXpR4N",
  "object": "payment_intent",
  "amount": 280000,
  "amount_capturable": 0,
  "amount_details": { "tip": {} },
  "amount_received": 280000,
  "application": null,
  "application_fee_amount": null,
  "automatic_payment_methods": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [
      {
        "id": "ch_3MLoTUFUSUvjNxGl2mjsvxS3",
        "object": "charge",
        "amount": 280000,
        "amount_captured": 280000,
        "amount_refunded": 0,
        "application": null,
        "application_fee": null,
        "application_fee_amount": null,
        "balance_transaction": "txn_3MLoTUFUSUvjNxGl2o7miq4i",
        "billing_details": {
          "address": {
            "city": null,
            "country": "TW",
            "line1": null,
            "line2": null,
            "postal_code": null,
            "state": null
          },
          "email": "admin@gmail.com",
          "name": "test",
          "phone": null
        },
        "calculated_statement_descriptor": "AMICAT PURCHASE",
        "captured": true,
        "created": 1672667700,
        "currency": "twd",
        "customer": "cus_N5zxtved7o3FPc",
        "description": null,
        "destination": null,
        "dispute": null,
        "disputed": false,
        "failure_balance_transaction": null,
        "failure_code": null,
        "failure_message": null,
        "fraud_details": {},
        "invoice": null,
        "livemode": false,
        "metadata": {},
        "on_behalf_of": null,
        "order": null,
        "outcome": {
          "network_status": "approved_by_network",
          "reason": null,
          "risk_level": "normal",
          "risk_score": 52,
          "seller_message": "Payment complete.",
          "type": "authorized"
        },
        "paid": true,
        "payment_intent": "pi_3MLoTUFUSUvjNxGl2jjXpR4N",
        "payment_method": "pm_1MLoTfFUSUvjNxGlwmv3oLHA",
        "payment_method_details": {
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "pass"
            },
            "country": "US",
            "exp_month": 12,
            "exp_year": 2034,
            "fingerprint": "3X8tJ0hhJJtKQ3mq",
            "funding": "credit",
            "installments": null,
            "last4": "4242",
            "mandate": null,
            "network": "visa",
            "three_d_secure": null,
            "wallet": null
          },
          "type": "card"
        },
        "receipt_email": null,
        "receipt_number": null,
        "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xS0Z2U2NGVVNVdmpOeEdsKLXEy50GMgZ8EyOuyuc6LBZLMNt_weVu1TknCuokNREf5imQFzGnYJx85EOLpI28ewdwfiMgzZC5qNBX",
        "refunded": false,
        "refunds": {
          "object": "list",
          "data": [],
          "has_more": false,
          "total_count": 0,
          "url": "/v1/charges/ch_3MLoTUFUSUvjNxGl2mjsvxS3/refunds"
        },
        "review": null,
        "shipping": null,
        "source": null,
        "source_transfer": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "succeeded",
        "transfer_data": null,
        "transfer_group": null
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/charges?payment_intent=pi_3MLoTUFUSUvjNxGl2jjXpR4N"
  },
  "client_secret": "pi_3MLoTUFUSUvjNxGl2jjXpR4N_secret_y5zQMJz4MVWy469bWGmzlZVIz",
  "confirmation_method": "automatic",
  "created": 1672667688,
  "currency": "twd",
  "customer": "cus_N5zxtved7o3FPc",
  "description": null,
  "invoice": null,
  "last_payment_error": null,
  "livemode": false,
  "metadata": {},
  "next_action": null,
  "on_behalf_of": null,
  "payment_method": "pm_1MLoTfFUSUvjNxGlwmv3oLHA",
  "payment_method_options": {
    "card": {
      "installments": null,
      "mandate_options": null,
      "network": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": ["card"],
  "processing": null,
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "succeeded",
  "transfer_data": null,
  "transfer_group": null
}
